routes/web.php

use Illuminate\Support\Facades\Log;
use Illuminate\Support\Facades\Route;

Route::get('/', function () {
    return view('blogs', [
        'blogs' => Blog::with('category')->get() //eager load //lazy loading
    ]);
});

Route::get('/blogs/{blog:slug}', function (Blog $blog) { //Blog::findOrFail($id)
    return view('blog', [
        'blog' => $blog
    ]);
})->where('blog', '[A-z\d\-_]+');

Route::get('categories/{category:slug}', function (Category $category) {
    return view('blogs', [
        'blogs' => $category->blogs
    ]);
});
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
SELECT * FROM `blogs` ORDER BY `created_at` DESC
SELECT * FROM `blogs`
SELECT * FROM `blogs` WHERE `blogs`.`category_id` = 1 and `blogs`.`category_id` IS not NULL